OndraBeran/stm32_trustzone_demo/Secure/Core/Src/pin_verification.c
/**
 * @file main.c
 * @brief Example usage of TROPIC01 flagship feature - 'Mac And Destroy' PIN verification engine.
 * For more info please refer to ODN_TR01_app_002_pin_verif.pdf
 * @copyright Copyright (c) 2020-2026 Tropic Square s.r.o.
 *
 * @license For the license see LICENSE.md in the root directory of this source tree.
 */

#include <errno.h>
#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

#include "libtropic.h"
#include "libtropic_common.h"
#include "libtropic_mbedtls_v4.h"
#include "libtropic_port_stm32u5xx.h"
#include "psa/crypto.h"
#include "stm32u5xx_hal_rng.h"

extern RNG_HandleTypeDef hrng;

lt_handle_t lt_handle = {0};
lt_dev_stm32u5xx_t device = {0};
lt_ctx_mbedtls_v4_t crypto_ctx;

// Pairing keys the model was configured with, defaults to prod0 keys.
// Provide your own keys here if you configured the model differently.
#define DEFAULT_SH0_PRIV sh0priv_prod0
#define DEFAULT_SH0_PUB sh0pub_prod0

/** @brief Last slot in User memory used for storing of M&D related data (only in this example). */
#define MACANDD_R_MEM_DATA_SLOT (511)

/** @brief Size of the print buffer. */
#define PRINT_BUFF_SIZE 196

/** @brief Number of MAC-and-Destroy rounds (only in this example). */
#define MACANDD_ROUNDS 5

#if (MACANDD_ROUNDS > 12)
#error \
    "For this example, MACANDD_ROUNDS must be less than 12. Generally, the maximum is TR01_MACANDD_ROUNDS_MAX."
#endif

/** @brief Minimal size of MAC-and-Destroy additional data (only in this example). */
#define MACANDD_ADD_SIZE_MIN 0
/** @brief Maximal size of MAC-and-Destroy additional data (only in this example). */
#define MACANDD_ADD_SIZE_MAX 128u
/** @brief Minimal size of MAC-and-Destroy PIN input (only in this example). */
#define MACANDD_PIN_SIZE_MIN 4u
/** @brief Maximal size of MAC-and-Destroy PIN input (only in this example). */
#define MACANDD_PIN_SIZE_MAX 8u

/**
 * @brief This structure holds data used by host during MAC-And-Destroy sequence.
 * Content of this struct must be stored in non-volatile memory, because it is used
 * between power cycles.
 */
struct lt_macandd_nvm_t {
    uint8_t i;
    uint8_t ci[MACANDD_ROUNDS * TR01_MAC_AND_DESTROY_DATA_SIZE];
    uint8_t t[PSA_HASH_LENGTH(PSA_ALG_SHA_256)];
} __attribute__((__packed__));

/**
 * @brief Simple XOR "encryption" function. Replace with another encryption algorithm if needed.
 *
 * @param data         32B of data to be encrypted
 * @param key          32B key used for encryption
 * @param destination  Buffer into which 32B of encrypted data will be placed
 */
static void encrypt(const uint8_t *data, const uint8_t *key, uint8_t *destination)
{
    for (uint8_t i = 0; i < 32; i++) {
        destination[i] = data[i] ^ key[i];
    }
}

/**
 * @brief Simple XOR "decryption" function. Replace with another decryption algorithm if needed.
 *
 * @param data         32B of data to be decrypted
 * @param key          32B key used for decryption
 * @param destination  Buffer into which 32B of decrypted data will be placed
 */
static void decrypt(const uint8_t *data, const uint8_t *key, uint8_t *destination)
{
    for (uint8_t i = 0; i < 32; i++) {
        destination[i] = data[i] ^ key[i];
    }
}

/**
 * @brief PSA Crypto HMAC-SHA256 wrapper.
 *
 * @param key       Key data buffer
 * @param key_len   Length of data in key buffer
 * @param data      Data buffer
 * @param data_len  Length of data buffer
 * @param output    Output buffer for HMAC result
 * @return          psa_status_t
 */
static psa_status_t hmac_sha256(const uint8_t *key, const size_t key_len, const uint8_t *data,
                                const size_t data_len, uint8_t *output)
{
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t key_id = 0;
    psa_status_t status;
    size_t output_len;

    // Set key attributes for HMAC.
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_SIGN_HASH);
    psa_set_key_algorithm(&attributes, PSA_ALG_HMAC(PSA_ALG_SHA_256));
    psa_set_key_type(&attributes, PSA_KEY_TYPE_HMAC);

    // Import key.
    status = psa_import_key(&attributes, key, key_len, &key_id);
    if (status != PSA_SUCCESS) {
        goto cleanup;
    }

    // Compute HMAC.
    status = psa_mac_compute(key_id, PSA_ALG_HMAC(PSA_ALG_SHA_256), data, data_len, output,
                             PSA_HASH_LENGTH(PSA_ALG_SHA_256), &output_len);

cleanup:
    if (key_id != 0) {
        psa_destroy_key(key_id);
    }
    psa_reset_key_attributes(&attributes);
    return status;
}

/**
 * @brief Example function for setting PIN with Mac And Destroy.
 *
 * @details The New PIN Setup procedure takes the user PIN, add data and high entropy master_secret as
 * an input, initializes the scheme slots and returns a 32-byte key final_key as derivative of the
 * master_secret.
 *
 * The MAC-and-Destroy PIN veriﬁcation scheme uses slots located in the TROPIC01’s ﬂash memory – one
 * slot per PIN entry attempt. These slots are ﬁrst initialized when a new PIN is being set up. The
 * slots are then invalidated (destroyed) one by one with each PIN entry attempt. When the correct PIN
 * is entered, the slots are initialized again, therefore the PIN entry limit is reset. PIN entry
 * attempt fails if:
 *  * PIN is invalid
 *  * The current slot is not initialized for a given PIN
 *  * The current slot is destroyed by previous invalid PIN entry attempt.
 *
 * There are more ways how to implement Mac And Destroy 'PIN set' functionality, differences could be
 * in way of handling nvm data, number of tries, algorithm used for encryption, etc. This function is
 * just one of the possible implementations of "PIN set".
 *
 * Take it as an inspiration, copy it into your project and adapt it to your specific hw resources.
 *
 * @param h           Handle for communication with TROPIC01
 * @param master_secret  32 bytes of random data (determines final_key)
 * @param PIN         Array of bytes (size between MACANDD_PIN_SIZE_MIN and MACANDD_PIN_SIZE_MAX)
 * representing PIN
 * @param PIN_size    Length of the PIN field
 * @param add         Additional data to be used in M&D sequence (size between MACANDD_ADD_SIZE_MIN and
 * MACANDD_ADD_SIZE_MAX). Pass NULL if no additional data should be used.
 * @param add_size    Length of additional data
 * @param final_key      Buffer into which final key will be placed when all went successfully
 * @return lt_ret_t   LT_OK if correct, otherwise LT_FAIL
 */
static lt_ret_t new_PIN_setup(lt_handle_t *h, const uint8_t *master_secret, const uint8_t *PIN,
                              const uint8_t PIN_size, const uint8_t *add, const uint8_t add_size,
                              uint8_t *final_key)
{
    if (!h || !master_secret || !PIN || (PIN_size < MACANDD_PIN_SIZE_MIN) ||
        (PIN_size > MACANDD_PIN_SIZE_MAX) || (add_size > MACANDD_ADD_SIZE_MAX) || !final_key) {
        // `add` parameter is not checked for NULL, because it can be NULL (handled in the lines
        // below).
        return LT_PARAM_ERR;
    }

    uint8_t add_size_checked = add_size;
    if (!add) {
        add_size_checked = 0;
    }

    psa_status_t psa_ret;

    // Clear variable for released final_key so there is known data (zeroes) in case this function
    // ended sooner then final_key was prepared.
    memset(final_key, 0, TR01_MAC_AND_DESTROY_DATA_SIZE);

