OndraBeran/stm32_trustzone_demo/Secure/Core/Src/pin_verification.c
    // Variable used during a process of getting a encryption key k_i.
    uint8_t v[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Variable used during a process of getting a encryption key k_i.
    uint8_t w_i[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};
    // Encryption key.
    uint8_t k_i[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Variable used to initialize slot(s).
    uint8_t u[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Helper array of zeroes (used as a key in KDF).
    const uint8_t zeros[32] = {0};

    // This organizes data which will be stored into nvm.
    struct lt_macandd_nvm_t nvm = {0};

    // User is expected to pass not only PIN, but might also pass another data (e.g. HW ID, ...).
    // Both arrays are concatenated and used together as an input for KDF.
    uint8_t kdf_input_buff[MACANDD_PIN_SIZE_MAX + MACANDD_ADD_SIZE_MAX];
    memcpy(kdf_input_buff, PIN, PIN_size);
    if (!add || add_size_checked == 0) {
        printf("\tNo additional data will be used in the following M&D sequence\n");
    }
    else {
        memcpy(kdf_input_buff + PIN_size, add, add_size_checked);
    }

    // Erase a slot in R-Memory, which will be used as a storage for NVM data.
    printf("\tErasing R_Mem User slot %d...", MACANDD_R_MEM_DATA_SLOT);
    lt_ret_t ret = lt_r_mem_data_erase(h, MACANDD_R_MEM_DATA_SLOT);
    if (ret != LT_OK) {
        fprintf(stderr, "\n\tFailed to erase User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    printf("OK\n");

    // Store number of attempts.
    nvm.i = MACANDD_ROUNDS;
    // Compute tag t = KDF(s, 0x00), save into nvm struct.
    // Tag will be later used during PIN_entry_check() to verify validity of final_key.
    psa_ret = hmac_sha256(master_secret, TR01_MAC_AND_DESTROY_DATA_SIZE, (uint8_t[]){0x00}, 1, nvm.t);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tt = KDF(s, 0x00) failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    // Compute u = KDF(s, 0x01).
    // This value will be sent through M&D sequence to initialize a slot.
    psa_ret = hmac_sha256(master_secret, TR01_MAC_AND_DESTROY_DATA_SIZE, (uint8_t[]){0x01}, 1, u);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tu = KDF(s, 0x01) failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    // Compute v = KDF(0, PIN||A) where 0 is all zeroes key.
    psa_ret = hmac_sha256(zeros, sizeof(zeros), kdf_input_buff, PIN_size + add_size_checked, v);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tv = KDF(0, PIN||A) failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    for (int i = 0; i < nvm.i; i++) {
        uint8_t ignore[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};

        // This call of a M&D sequence results in initialization of one slot.
        printf("\n\tDoing M&D sequence to initialize a slot...");
        ret = lt_mac_and_destroy(h, i, u, ignore);
        if (ret != LT_OK) {
            fprintf(stderr, "\n\tFailed while doing M&D sequence, ret=%s\n", lt_ret_verbose(ret));
            goto exit;
        }
        printf("OK\n");

        // This call of a M&D sequence overwrites a previous slot, but key w is returned.
        // This key is later used to derive k_i, which is used to encrypt the master_secret.
        printf("\tDoing M&D sequence to overwrite previous slot...");
        ret = lt_mac_and_destroy(h, i, v, w_i);
        if (ret != LT_OK) {
            fprintf(stderr, "\nFailed while doing M&D sequence, ret=%s\n", lt_ret_verbose(ret));
            goto exit;
        }
        printf("OK\n");

        // Now the slot is initialized again by calling M&D sequence again with 'u'.
        printf("\tDoing M&D sequence again to initialize a slot...");
        ret = lt_mac_and_destroy(h, i, u, ignore);
        if (ret != LT_OK) {
            fprintf(stderr, "\n\tFailed while doing M&D sequence, ret=%s\n", lt_ret_verbose(ret));
            goto exit;
        }
        printf("OK\n");

        // Derive k_i = KDF(w_i, PIN||A); k_i will be used to encrypt master_secret.
        psa_ret = hmac_sha256(w_i, sizeof(w_i), kdf_input_buff, PIN_size + add_size_checked, k_i);
        if (psa_ret != PSA_SUCCESS) {
            fprintf(stderr, "\tk_i = KDF(w_i, PIN||A) failed, psa_status_t=%ld\n", psa_ret);
            goto exit;
        }

        // Encrypt master_secret using k_i as a key and store ciphertext into non volatile storage.
        encrypt(master_secret, k_i, nvm.ci + (i * TR01_MAC_AND_DESTROY_DATA_SIZE));
    }

    // Persistently save nvm data into TROPIC01's R-Memory slot.
    printf("\n\tWriting NVM data into R_Mem User slot %d...", MACANDD_R_MEM_DATA_SLOT);
    ret = lt_r_mem_data_write(h, MACANDD_R_MEM_DATA_SLOT, (uint8_t *)&nvm, sizeof(nvm));
    if (ret != LT_OK) {
        fprintf(stderr, "\tFailed to write User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    printf("OK\n");

    // final_key is released to the caller.
    psa_ret = hmac_sha256(master_secret, TR01_MAC_AND_DESTROY_DATA_SIZE, (uint8_t *)"2", 1, final_key);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tFail during last computation of final_key, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

// Cleanup all sensitive data from memory.
// We recommend using a safe function for this. Refer to the link below for some information.
// https://www.gnu.org/software/libc/manual/html_node/Erasing-Sensitive-Data.html
exit:
    memset(kdf_input_buff, 0, PIN_size + add_size_checked);
    memset(u, 0, sizeof(u));
    memset(v, 0, sizeof(v));
    memset(w_i, 0, sizeof(w_i));
    memset(k_i, 0, sizeof(k_i));
    memset(&nvm, 0, sizeof(nvm));

    return ret;
}

/**
 * @brief Example function for checking PIN with Mac And Destroy.
 *
 * @details The Pin Entry Check procedure takes the PIN and additional add data entered by the user as
 * an input, and checks the PIN. If successful, the correct key k is returned.
 *
 * There are more ways how to implement Mac And Destroy 'PIN check' functionality, differences could be
 * in way of handling nvm data, number of tries, algorithm used for decryption, etc. This function is
 * just one of the possible implementations of "PIN check".
 *
 * Take it as an inspiration, copy it into your project and adapt it to your specific hw resources.
 *
 * @param h           Handle for communication with TROPIC01
 * @param PIN         Array of bytes (size between MACANDD_PIN_SIZE_MIN and MACANDD_PIN_SIZE_MAX)
 * representing PIN
 * @param PIN_size    Length of the PIN field
 * @param add         Additional data to be used in M&D sequence (size between MACANDD_ADD_SIZE_MIN and
 * MACANDD_ADD_SIZE_MAX). Pass NULL if no additional data should be used.
 * @param add_size    Length of additional data
 * @param final_key   Buffer into which final_key will be saved
 * @return lt_ret_t   LT_OK if correct, otherwise LT_FAIL
 */
static lt_ret_t PIN_entry_check(lt_handle_t *h, const uint8_t *PIN, const uint8_t PIN_size,
                                const uint8_t *add, const uint8_t add_size, uint8_t *final_key)
{
    if (!h || !PIN || (PIN_size < MACANDD_PIN_SIZE_MIN) || (PIN_size > MACANDD_PIN_SIZE_MAX) ||
        (add_size > MACANDD_ADD_SIZE_MAX) || !final_key) {
        // `add` parameter is not checked for NULL, because it can be NULL (handled in the lines
        // below).
        return LT_PARAM_ERR;
    }
    if (h->l3.session_status != LT_SECURE_SESSION_ON) {
        return LT_HOST_NO_SESSION;
    }

    uint8_t add_size_checked = add_size;
    if (!add) {
        add_size_checked = 0;
    }

    psa_status_t psa_ret;

    // Clear variable for released final_key so there is known data (zeroes) in case this function
    // ended sooner then final_key was prepared.
    memset(final_key, 0, TR01_MAC_AND_DESTROY_DATA_SIZE);

    // Variable used during a process of getting a decryption key k_i.
    uint8_t v_[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Variable used during a process of getting a decryption key k_i.
    uint8_t w_i[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};
    // Decryption key.
    uint8_t k_i[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Secret.
    uint8_t s_[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};
    // Tag.
    uint8_t t_[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Value used to initialize Mac And Destroy's slot after a correct PIN try.
    uint8_t u[PSA_HASH_LENGTH(PSA_ALG_SHA_256)] = {0};
    // Helper array of zeroes (used as a key in KDF).
    const uint8_t zeros[32] = {0};

    // This organizes data which will be read from nvm.
    struct lt_macandd_nvm_t nvm = {0};

