OndraBeran/stm32_trustzone_demo/Secure/Core/Src/pin_verification.c
    // User might pass not only PIN, but also another data(e.g. HW ID, ...) if needed.
    // Both arrays are concatenated and used together as an input for KDF.
    uint8_t kdf_input_buff[MACANDD_PIN_SIZE_MAX + MACANDD_ADD_SIZE_MAX];
    memcpy(kdf_input_buff, PIN, PIN_size);
    if (!add || add_size_checked == 0) {
        printf("\tNo additional data will be used in the following M&D sequence\n");
    }
    else {
        memcpy(kdf_input_buff + PIN_size, add, add_size_checked);
    }

    // Load M&D data from TROPIC01's R-Memory.
    printf("\tReading M&D data from R_Mem User slot %d...", MACANDD_R_MEM_DATA_SLOT);
    uint16_t read_size;
    lt_ret_t ret = lt_r_mem_data_read(h, MACANDD_R_MEM_DATA_SLOT, (uint8_t *)&nvm, sizeof(nvm),
                                      &read_size);
    if (ret != LT_OK) {
        fprintf(stderr, "\n\tFailed to read User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    printf("OK\n");

    // if i == 0: FAIL (no attempts remaining).
    printf("\tChecking if nvm.i != 0...");
    if (nvm.i == 0) {
        fprintf(stderr, "\tnvm.i == 0");
        ret = LT_FAIL;
        goto exit;
    }
    printf("OK\n");

    // Decrement variable which holds number of tries.
    // Let i = i - 1
    nvm.i--;

    // and store M&D data back to TROPIC01's R-Memory.
    printf("\tWriting back M&D data into R_Mem User slot %d (erase, then write)...",
           MACANDD_R_MEM_DATA_SLOT);
    ret = lt_r_mem_data_erase(h, MACANDD_R_MEM_DATA_SLOT);
    if (ret != LT_OK) {
        fprintf(stderr, "\n\tFailed to erase User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    ret = lt_r_mem_data_write(h, MACANDD_R_MEM_DATA_SLOT, (uint8_t *)&nvm, sizeof(nvm));
    if (ret != LT_OK) {
        fprintf(stderr, "\n\tFailed to write User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    printf("OK\n");

    // Compute v’ = KDF(0, PIN’||A).
    psa_ret = hmac_sha256(zeros, sizeof(zeros), kdf_input_buff, PIN_size + add_size_checked, v_);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tv' = KDF(0, PIN'||A) failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    // Execute w’ = MACANDD(i, v’).
    printf("\tDoing M&D sequence...");
    ret = lt_mac_and_destroy(h, nvm.i, v_, w_i);
    if (ret != LT_OK) {
        fprintf(stderr, "\tFailed while doing M&D sequence, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    printf("OK\n");

    // Compute k’_i = KDF(w’, PIN’||A).
    psa_ret = hmac_sha256(w_i, sizeof(w_i), kdf_input_buff, PIN_size + add_size_checked, k_i);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tk'_i = KDF(w', PIN'||A) failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    // Read the ciphertext c_i and tag t from NVM,
    // decrypt c_i with k’_i as the key and obtain s_.
    decrypt(nvm.ci + (nvm.i * TR01_MAC_AND_DESTROY_DATA_SIZE), k_i, s_);

    // Compute tag t = KDF(s_, "0x00").
    psa_ret = hmac_sha256(s_, sizeof(s_), (uint8_t[]){0x00}, 1, t_);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tt = KDF(s_, \"0x00\") failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    // If t’ != t: FAIL
    if (memcmp(nvm.t, t_, sizeof(t_)) != 0) {
        ret = LT_FAIL;
        fprintf(stderr, "\tTags do not match!\n");
        goto exit;
    }

    // Pin is correct, now initialize macandd slots again:
    // Compute u = KDF(s’, "0x01").
    psa_ret = hmac_sha256(s_, sizeof(s_), (uint8_t[]){0x01}, 1, u);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tu = KDF(s', \"0x01\") failed, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

    // TODO: originally < MACANDD_ROUNDS - 1, not sure if this is corrects, but it fixes the issue
    for (int x = nvm.i; x < MACANDD_ROUNDS; x++) {
        uint8_t ignore[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};

        printf("\tDoing M&D sequence...");
        ret = lt_mac_and_destroy(h, x, u, ignore);
        if (ret != LT_OK) {
            fprintf(stderr, "\n\tFailed while doing M&D sequence, ret=%s\n", lt_ret_verbose(ret));
            goto exit;
        }
        printf("OK\n");
    }

    // Set variable which holds number of tries back to initial state MACANDD_ROUNDS
    nvm.i = MACANDD_ROUNDS;

    // Store NVM data for future use
    printf("\tWriting M&D data into R_Mem User slot %d for future use (erase, then write)...",
           MACANDD_R_MEM_DATA_SLOT);
    ret = lt_r_mem_data_erase(h, MACANDD_R_MEM_DATA_SLOT);
    if (ret != LT_OK) {
        fprintf(stderr, "\n\tFailed to erase User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    ret = lt_r_mem_data_write(h, MACANDD_R_MEM_DATA_SLOT, (uint8_t *)&nvm, sizeof(nvm));
    if (ret != LT_OK) {
        fprintf(stderr, "\n\tFailed to write User slot, ret=%s\n", lt_ret_verbose(ret));
        goto exit;
    }
    printf("OK\n");

    // Calculate final_key and store it into passed array
    psa_ret = hmac_sha256(s_, sizeof(s_), (uint8_t *)"2", 1, final_key);
    if (psa_ret != PSA_SUCCESS) {
        fprintf(stderr, "\tFail during last computation of final_key, psa_status_t=%ld\n", psa_ret);
        goto exit;
    }

// Cleanup all sensitive data from memory.
// We recommend using a safe function for this. Refer to the link below for some information.
// https://www.gnu.org/software/libc/manual/html_node/Erasing-Sensitive-Data.html
exit:
    memset(kdf_input_buff, 0, PIN_size + add_size_checked);
    memset(w_i, 0, sizeof(w_i));
    memset(k_i, 0, sizeof(k_i));
    memset(v_, 0, sizeof(v_));
    memset(s_, 0, sizeof(s_));
    memset(t_, 0, sizeof(t_));
    memset(u, 0, sizeof(u));
    memset(&nvm, 0, sizeof(nvm));

    return ret;
}

/**
 * @brief Read the number of remaining tries from non-volatile memory. In case of any error -1 is returned. This function is just an example of how to read the number of
 * @return number of remaining tries, -1 on failure.
 */
uint8_t remaining_tries() {
    struct lt_macandd_nvm_t nvm = {0};
    uint16_t read_size;
    lt_ret_t ret = lt_r_mem_data_read(&lt_handle, MACANDD_R_MEM_DATA_SLOT, (uint8_t *)&nvm, sizeof(nvm),
                                      &read_size);
    if (ret != LT_OK) {
        return -1;
    }
    
    return nvm.i;
}

/**
 * @brief Initialize the RNG and PSA Crypto subsystem, configure the device, and open a Secure
 * Session. On success all three output parameters are fully initialized and linked. On failure
 * the caller does not need to perform any cleanup.
 *
 * @param handle      Zeroed lt_handle_t allocated by the caller.
 * @param device      Zeroed lt_dev_stm32u5xx_t allocated by the caller.
 * @param crypto_ctx  Uninitialized lt_ctx_mbedtls_v4_t allocated by the caller.
 * @return 0 on success, -1 on failure.
 */
static int lt_start_session(lt_handle_t *handle, lt_dev_stm32u5xx_t *device,
                             lt_ctx_mbedtls_v4_t *crypto_ctx)
{
    /* IMPORTANT: Do not forget to initialize RNG peripheral
        at the beginning of your application using HAL_RNG_Init()! */
    if (HAL_RNG_GetState(&hrng) != HAL_RNG_STATE_READY) {
        fprintf(stderr, "RNG peripheral is not ready! Make sure to initialize it before using any Libtropic function, ret=%d\n", (int)HAL_RNG_GetState(&hrng));
        return -1;
    }

    // Cryptographic function provider initialization.
    //
    // In production, this would typically be done only once,
    // usually at the start of the application or before
    // the first use of cryptographic functions but no later than
    // the first occurrence of any Libtropic function
    psa_status_t status = psa_crypto_init();
    if (status != PSA_SUCCESS) {
        fprintf(stderr, "PSA Crypto initialization failed, status=%ld (psa_status_t)\n", status);
        return -1;
    }

    device->spi_instance = SPI1;
    device->baudrate_prescaler = SPI_BAUDRATEPRESCALER_16;

    /* Enable clock of the GPIO bank where our custom chip select output is present. */
    // LT_SPI_CS_CLK_ENABLE(); /* Defined in main.h. */
    device->spi_cs_gpio_bank = GPIOC;
    device->spi_cs_gpio_pin = GPIO_PIN_9;

    device->rng_handle = &hrng;

    handle->l2.device = device;
    // Generate seed for the PRNG and seed it.
    // Note: model uses rand(), which is not cryptographically secure. Better alternative should be
    // used in production.

    handle->l3.crypto_ctx = crypto_ctx;

    printf("Initializing handle...");
    lt_ret_t ret = lt_init(handle);
    if (ret != LT_OK) {
        fprintf(stderr, "\nFailed to initialize handle, ret=%s\n", lt_ret_verbose(ret));
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("OK\n");

