OndraBeran/stm32_trustzone_demo/Secure/Core/Src/pin_verification.c
    // We need to ensure we are not in the Start-up Mode, as L3 commands are available only in the
    // Application Firmware.
    printf("Sending reboot request...");
    ret = lt_reboot(handle, TR01_REBOOT);
    if (ret != LT_OK) {
        fprintf(stderr, "\nlt_reboot() failed, ret=%s\n", lt_ret_verbose(ret));
        lt_deinit(handle);
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("OK\n");

    printf("Starting Secure Session with key slot %d...", (int)TR01_PAIRING_KEY_SLOT_INDEX_0);
    ret = lt_verify_chip_and_start_secure_session(handle, DEFAULT_SH0_PRIV, DEFAULT_SH0_PUB,
                                                  TR01_PAIRING_KEY_SLOT_INDEX_0);
    if (ret != LT_OK) {
        fprintf(stderr, "\nFailed to start Secure Session with key %d, ret=%s\n",
                (int)TR01_PAIRING_KEY_SLOT_INDEX_0, lt_ret_verbose(ret));
        fprintf(stderr,
                "Check if you use correct SH0 keys! Hint: if you use an engineering sample chip, "
                "compile with "
                "-DLT_SH0_KEYS=eng_sample\n");
        lt_deinit(handle);
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("OK\n");

    return 0;
}

static int deinit(lt_handle_t *lt_handle) {
    lt_ret_t ret = lt_session_abort(lt_handle);
    if (LT_OK != ret) {
        fprintf(stderr, "\nFailed to abort Secure Session, ret=%s\n", lt_ret_verbose(ret));
        lt_deinit(lt_handle);
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("OK\n");

    printf("Deinitializing handle...");
    ret = lt_deinit(lt_handle);
    if (LT_OK != ret) {
        fprintf(stderr, "\nFailed to deinitialize handle, ret=%s\n", lt_ret_verbose(ret));
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("OK\n");

    // Cryptographic function provider deinitialization.
    //
    // In production, this would be done only once, typically
    // during termination of the application.
    mbedtls_psa_crypto_free();

    return 0;
}

int pin_verification_init(void)
{
    if (lt_start_session(&lt_handle, &device, &crypto_ctx) != 0) {
        return -1;
    }

    lt_ret_t ret;

    // This variable stores final_key which is released to the user after successful PIN check or PIN
    // set.
    uint8_t final_key_initialized[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};

    // User's PIN.
    uint8_t pin[] = {1, 2, 3, 4};

    printf("\nWill initialize Mac-And-Destroy:\n");
    printf("Generating random master_secret (using TROPIC01's TRNG)...");
    uint8_t master_secret[TR01_MAC_AND_DESTROY_DATA_SIZE] = {0};
    ret = lt_random_value_get(&lt_handle, master_secret, TR01_MAC_AND_DESTROY_DATA_SIZE);
    if (ret != LT_OK) {
        fprintf(stderr, "\nFailed to get random bytes, ret=%s\n", lt_ret_verbose(ret));
        lt_session_abort(&lt_handle);
        lt_deinit(&lt_handle);
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("OK\n");

    char print_buff[PRINT_BUFF_SIZE];
    ret = lt_print_bytes(master_secret, sizeof(master_secret), print_buff, PRINT_BUFF_SIZE);
    if (ret != LT_OK) {
        fprintf(stderr, "lt_print_bytes failed, ret=%s\n", lt_ret_verbose(ret));
        lt_session_abort(&lt_handle);
        lt_deinit(&lt_handle);
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("Generated master_secret: %s\n", print_buff);

    // Set the PIN and log out the final_key
    printf("Setting the user PIN...\n");
    ret = new_PIN_setup(&lt_handle, master_secret, pin, sizeof(pin), NULL,
                        0, final_key_initialized);
    if (ret != LT_OK) {
        fprintf(stderr, "\nFailed to set the user PIN, ret=%s\n", lt_ret_verbose(ret));
        lt_session_abort(&lt_handle);
        lt_deinit(&lt_handle);
        mbedtls_psa_crypto_free();
        return -1;
    }
    printf("PIN was set successfully\n");

    printf("remaining tries: %d\n", remaining_tries(&lt_handle));

    return ret;
}

lt_ret_t check_pin(const uint8_t *pin, const uint8_t pin_size)
{
    return PIN_entry_check(&lt_handle, pin, pin_size, NULL, 0, (uint8_t[TR01_MAC_AND_DESTROY_DATA_SIZE]){0});
}